<?php

return [
    'success' => 'نجاح',
    'error' => 'خطأ',
    'user_registered' => 'تم التسجيل بنجاح',
    'user_logged_in' => 'تم تسجيل الدخول بنجاح',
    'password_reset_link_sent' => 'رابط إعادة تعيين كلمة المرور تم إرساله بنجاح',
    'password_reset' => 'تم إعادة تعيين كلمة المرور بنجاح',
    'invalid_credentials' => 'بيانات الاعتماد غير صحيحة.',
    'unable_to_send_reset_link' => 'تعذر إرسال رابط إعادة تعيين كلمة المرور.',
    'login_failed' => 'فشل تسجيل الدخول. يرجى التحقق من بيانات الاعتماد الخاصة بك والمحاولة مرة أخرى.',
    'password_reset_failed' => 'فشل إعادة تعيين كلمة المرور. يرجى المحاولة مرة أخرى لاحقًا.',

    'required' => 'هذا الحقل مطلوب.',
    'email' => 'يجب أن يكون البريد الإلكتروني صالحاً.',
    'string' => 'يجب أن يكون النص عبارة عن سلسلة من الأحرف.',
    'max' => 'يجب ألا يتجاوز :attribute الحد الأقصى المسموح به من :max.',
    'min' => 'يجب أن يكون :attribute على الأقل :min حرفاً.',
    'unique' => 'لقد تم تسجيل هذا :attribute بالفعل.',
    'confirmed' => 'التأكيد غير متطابق.',
    'boolean' => 'يجب أن يكون :attribute قيمة منطقية (صح/خطأ).',


];
