<?php

return [
    'name' => 'اسم العقار',
    'description' => 'الوصف',
    'location' => 'الموقع',
    'price' => 'السعر',
    'status' => 'الحالة',
    'validation' => [
        'required' => 'هذا الحقل مطلوب.',
        'max_name' => 'لا يمكن أن يكون الاسم أكثر من 255 حرفًا.',
        'numeric_price' => 'يجب أن يكون السعر رقمًا.',
        'invalid_status' => 'حالة غير صالحة.',
        'image' => 'يجب أن يكون كل ملف صورة.',
        'mimes_image' => 'يجب أن يكون كل ملف صورة بصيغة JPEG أو PNG.',
        'max_size' => 'لا يمكن أن تكون الصورة أكبر من 2 ميغابايت.',
    ],
    'success' => [
        'created' => 'تم إنشاء العقار بنجاح.',
        'list_retrieved' => 'تم استرجاع القائمة بنجاح.',
        'updated' => 'تم تحديث العقار بنجاح.',
        'found' => 'تم العثور على العقار.',
        'deleted' => 'تم حذف العقار بنجاح.',


    ],
    'error' => [
        'creation_failed' => 'فشل في إنشاء العقار.',
        'not_found' => 'العقار غير موجود.',
        'update_failed' => 'فشل في تحديث العقار.',
        'deleted' => 'فشل في حذف العقار.',
        'authorization' => 'ليس لديك صلاحية لحذف هذا العقار',


    ],

];
